[
  {
    "userid": "20171216225100",
    "createdate": "2017.12.12",
    "rating": "1",
    "comments": [],
    "title": "Грязные трюки и оперативка",
    "body": "Проблемы с ограничениями памяти давно в прошлом? Оказывается, нет. Плохо работают с памятью не только некоторые коммерческие движки — у многих платформ достаточно агрессивные требования к ОЗУ. Кроме того, к ним добавляются ещё и ограничения по размерам дисков и картриджей."
  },
  {
    "userid": "20171216232100",
    "createdate": "2016.01.19",
    "rating": "7",
    "comments": [],
    "title": "Scrum внедрили, agile — забыли",
    "body": "Недавно мне посчастливилось начать работу с одной относительно немаленькой компанией (~100 человек), где, как выразился наниматель, “по-отдельности все хорошие специалисты, а вместе работать не получается”. Ну, думаю, я как раз специализируюсь на создании команд, дай, думаю, помогу чем смогу. Пообщались на собеседовании на тему общего понимания цели компании, об условиях, в которых возможна успешная совместная работа, о максимальном использовании компетенций сотрудников и о вовлечении в общее дело. Казалось бы, мысли у нас с нанимателем сходятся, но сам держу ухо востро — знаю о негативной репутации компании у потенциальных соискателей в городе. Ну что же, тем интереснее будет задача!"
  },
  {
    "userid": "20171216232200",
    "createdate": "2016.11.07",
    "rating": "4",
    "comments": [],
    "title": "Как подружить Skype и прокси",
    "body": "Всем добра, хабровчане! В статье расскажу как победить этот долбаный Skype и заставить его работать с Squid, но применимо к любому http(s) прокси. Будем использовать последний скайп. На данный момент это 7.40 и конечно, с упором на то, что очередной апдейт ничего не сломает, а если и сломает то надо будет чуток докрутить, а не откатывать версию. Сразу скажу, по сути описанный метод — это хак, т.к. актуальный скайп со сквидом работать не умеет, ну или мне не удалось победить, да и в интернете я не нашел решения, которое бы для меня взлетело."
  }
]