[
  {
    "articleid": "20171212111704",
    "groupid": "20180110175900",
    "userid": "20171212221055",
    "createdate": "2017.12.12",
    "rating": "1",
    "comments": [],
    "title": "Грязные трюки и оперативка",
    "body": "<div>Проблемы с ограничениями памяти давно в прошлом? Оказывается, нет. Плохо работают с памятью не только некоторые коммерческие движки — у многих платформ достаточно агрессивные требования к ОЗУ. Кроме того, к ним добавляются ещё и ограничения по размерам дисков и картриджей.</div>"
  },
  {
    "articleid": "20160119152155",
    "groupid": "20180110175900",
    "userid": "20161010145133",
    "createdate": "2016.01.19",
    "rating": "7",
    "comments": [],
    "title": "Scrum внедрили, agile — забыли",
    "body": "<div>Недавно мне посчастливилось начать работу с одной относительно немаленькой компанией (~100 человек), где, как выразился наниматель, “по-отдельности все хорошие специалисты, а вместе работать не получается”. Ну, думаю, я как раз специализируюсь на создании команд, дай, думаю, помогу чем смогу. Пообщались на собеседовании на тему общего понимания цели компании, об условиях, в которых возможна успешная совместная работа, о максимальном использовании компетенций сотрудников и о вовлечении в общее дело. Казалось бы, мысли у нас с нанимателем сходятся, но сам держу ухо востро — знаю о негативной репутации компании у потенциальных соискателей в городе. Ну что же, тем интереснее будет задача!</div>"
  },
  {
    "articleid": "20161107212805",
    "groupid": "20180110175930",
    "userid": "20180101121720",
    "createdate": "2016.11.07",
    "rating": "4",
    "comments": [],
    "title": "Как подружить Skype и прокси",
    "body": "<div>Всем добра, хабровчане! В статье расскажу как победить этот долбаный Skype и заставить его работать с Squid, но применимо к любому http(s) прокси. Будем использовать последний скайп. На данный момент это 7.40 и конечно, с упором на то, что очередной апдейт ничего не сломает, а если и сломает то надо будет чуток докрутить, а не откатывать версию. Сразу скажу, по сути описанный метод — это хак, т.к. актуальный скайп со сквидом работать не умеет, ну или мне не удалось победить, да и в интернете я не нашел решения, которое бы для меня взлетело.</div>"
  },
  {
    "articleid": "20170110074533",
    "groupid": "20180110175930",
    "userid": "20180102080600",
    "createdate": "2017.01.10",
    "rating": "33",
    "comments": [],
    "title": "CPU сдаст вас с потрохами: самая серьезная дыра в безопасности за всю историю наблюдений?",
    "body": "<div>Исследователи Google опубликовали исследование «Reading privileged memory with a side-channel», в котором они описывают найденную ими аппаратную уязвимость, которая затрагивает практически все современные и устаревшие процессоры вне зависимости от операционной системы. Строго говоря, уязвимостей целых две. Одной подвержены многие процессоры Intel (на них проводилось исследование). AMD с ARM также уязвимы, но атаку реализовать сложнее.     Атака позволяет получить доступ к защищенной памяти из кода, который не обладает соответствующими правами. Пожалуй, самое вероятное и неприятное применение на данный момент — получение дампа системной памяти во время выполнения JavaScript. Другой интересный вариант — эскалация прав чтения памяти из виртуальной машины. Как вам VPS, который ворует данные из других машин хостера? Эксплуатация уязвимости не оставляет следов.</div>"
  },
  {
    "articleid": "20170519221017",
    "groupid": "20180110180000",
    "userid": "20180104175504",
    "createdate": "2017.05.19",
    "rating": "22",
    "comments": [],
    "title": "[Перевод] IOHIDeous — новогодняя zero-day уязвимость от macOS",
    "body": "<div>Разработчик c GitHub ником Siguza, сделал неортодоксальный новогодний подарок — обнаружил уже долго существующую zero-day уязвимость в macOS, позволяющую атакующему получить root доступ к системе для дальнейшей ее компрометаци. Уязвимость существует уже довольно продолжительный период времени но не предоставляет возможности для удаленного взлома системы. Siguza, который является программистом и хакером из Швейцарии, детально описал уязвимость и дал ей название IOHIDeous. По заявлению Siguza, данной уязвимости подвержены все версии macOS, выпущенные за последние 15 лет.</div>"
  },
  {
    "articleid": "20170717151521",
    "groupid": "20180110180029",
    "userid": "20150217121722",
    "createdate": "2017.07.17",
    "rating": "19",
    "comments": [],
    "title": "JavaScript: 12 вопросов и ответов",
    "body": "<div>JavaScript — это потрясающий инструмент, который можно найти буквально в каждом углу современного интернета. Но даже несмотря на его невероятную распространённость, и профессионалам в области JS всегда будет чему поучиться. Всегда найдётся что-то такое, чего они не знают. В этом материале вы найдёте разбор двенадцати вопросов о JavaScript, на которые нередко не могут ответить даже опытные разработчики. Сначала мы рассмотрим десять типичных вопросов, включая такие, которые часто всплывают на собеседованиях. Оставшиеся два вопроса посвящены более сложным и неоднозначным вещам, в частности, использованию JS для улучшения производительности веб-страниц и разработке приложений, которые не теряют актуальности с течением времени.</div>"
  }
]